app/Controllers/CAdmin.php

SELECT *
FROM `admin`
WHERE `nama` = 'Alfiansyah Achmad'
 LIMIT 1
---
    public function account()
    {

        $user = $this->session->get('user');
        $result = $this->modelAdmin->where('nama', $user['nama'])->first();