app/Controllers/CBuku.php

    public function index()
    {

        $data = [
            'title_web' => 'Daftar Buku | E-Library',
            'judul' => 'Daftar Buku',
            'user' => $this->session->get('user'),
            'buku' => $this->modelBuku->findAll(),
            'kategori_buku' => $this->modelKategoriBuku->findAll(),
---
SELECT *
FROM `buku`
SELECT *
FROM `kategori_buku`