app/Controllers/CClient.php

    public function index()
    {
        $modelBuku = new MBuku();
        $modelKategoriBuku = new MKategoriBuku();

        $data['judul'] = 'Daftar Buku';
        //$data['user'] = $this->session->get('user');
        $data['user'] = $this->session->get('user');
        $data['buku'] = $modelBuku->findAll();
        $data['kategori_buku'] = $modelKategoriBuku->findAll();
---
SELECT *
FROM `buku`
SELECT *
FROM `kategori_buku`