app/Controllers/CKategoriBuku.php

SELECT *
FROM `kategori_buku`
---
    public function index()
    {
        $data = [
            'title_web' => 'Daftar Kategori Buku | E-Library',
            'judul' => 'Daftar Kategori Buku',
            'user' => $this->session->get('user'),
            'kategori_buku' => $this->modelKategoriBuku->findAll(),