app/Controllers/CLogin.php

    public function processLogin()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $siAdmin = $this->modelAdmin->where('email', $email)->first();

        if (!$siAdmin) {
            //return $this->response->setJSON(['message' => 'Email tidak ditemukan'])->setStatusCode(400);
            return redirect()->to('/elibrary/login')->with('error', 'Email tidak ditemukan!');
        }

        if (!password_verify($password, $siAdmin['password'])) {
            //return $this->response->setJSON(['message' => 'Password tidak valid'])->setStatusCode(400);
            return redirect()->to('/elibrary/login')->with('error', 'Password tidak valid!');
        }

        $authKey = $this->generateRandomString();
        $this->modelAdminToken->insert([
            'admin_id' => $siAdmin['id'],
            'auth_key' => $authKey
        ]);
---
SELECT *
FROM `admin`
WHERE `email` = 'admin@admin.com'
 LIMIT 1
INSERT INTO `admin_token` (`admin_id`, `auth_key`) VALUES ('18', 'DwCCeyzxWu8llT4KcyFqBgCYfllxRaJBarpd2seDnG8E4lvRHSU5eTM0vn79lv8uwMrAbxR6AmNqKTWzppxaSauW3o6ziVShExEi')

    public function processLogout()
    {
        $this->modelAdminToken = new MAdminToken();
        $memberId = $this->session->get("user.id");

        if ($memberId) {
            $this->modelAdminToken->where('admin_id', $memberId)->delete();
---
DELETE FROM `admin_token`
WHERE `admin_id` = '18'