app/Controllers/CMurid.php

    public function index()
    {
        $data = [
            'title_web' => 'E-Library | Daftar Murid',
            'judul' => 'Daftar Murid',
            'user' => $this->session->get('user'),
            'daftar_murid' => $this->modelMurid->findAll()
---
SELECT *
FROM `daftar_murid`