app/Controllers/CPeminjamanBuku.php

    public function index()
    {
        // Mengambil data peminjaman buku
        $peminjaman_buku = $this->modelPeminjamanBuku->findAll();

        // Mengambil detail peminjam untuk setiap peminjaman buku
        foreach ($peminjaman_buku as $index => $peminjaman) {
            $detail_peminjam = $this->getDetailPeminjam($peminjaman['nama_peminjam']);
            $peminjaman_buku[$index]['detail_peminjam'] = $detail_peminjam;

            // Mengambil detail buku untuk setiap peminjaman buku
            $detail_buku = $this->getDetailBuku($peminjaman['buku_dipinjam']);
            $peminjaman_buku[$index]['detail_buku'] = $detail_buku;
        }

        $data = [
            'title_web' => 'Daftar Peminjaman Buku | E-Library',
            'judul' => 'Data Peminjaman Buku',
            'user' => $this->session->get('user'),
            'buku' => $this->modelBuku->findAll(),
            'daftar_murid' => $this->modelMurid->findAll(),
            'peminjaman_buku' => $this->modelPeminjamanBuku->findAll(),
            'admin' => $this->modelAdmin->findAll(),
---
SELECT *
FROM `peminjaman_buku`
SELECT *
FROM `buku`
SELECT *
FROM `daftar_murid`
SELECT *
FROM `admin`

    private function getDetailBuku($judulBuku)
    {
        // Mengambil detail buku dari model buku berdasarkan judul buku
        return $this->modelBuku->where('judul_buku', $judulBuku)->first();
---
SELECT *
FROM `buku`
WHERE `judul_buku` = 'baru12'
 LIMIT 1