app/Controllers/CPengembalianBuku.php

SELECT *
FROM `buku`
SELECT *
FROM `daftar_murid`
SELECT *
FROM `peminjaman_buku`
SELECT *
FROM `admin`
SELECT *
FROM `pengembalian_buku`
---
    public function index()
    {
        $data = [
            'title_web' => 'Data Peminjaman Buku | E-Library',
            'judul' => 'Data Peminjaman Buku',
            'user' => $this->session->get('user'),
            'buku' => $this->modelBuku->findAll(),
            'daftar_murid' => $this->modelMurid->findAll(),
            'peminjaman_buku' => $this->modelPeminjamanBuku->findAll(),
            'member' => $this->modelAdmin->findAll(),
            'pengembalian_buku' => $this->modelPengembalianBuku->findAll(),
        ];

        $pengembalian_buku = $this->modelPengembalianBuku->findAll();

SELECT *
FROM `buku`
WHERE `judul_buku` = 'Sepeda'
 LIMIT 1
---
    private function getDetailBuku($judulBuku)
    {
        return $this->modelBuku->where('judul_buku', $judulBuku)->first();