app/Models/MBuku.php

    public function countBooks()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `buku`