app/Models/MPeminjamanBuku.php

    public function countPeminjaman()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `peminjaman_buku`