app/Models/MPengembalianBuku.php

    public function countPengembalian()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `pengembalian_buku`